ArteryTek/AT32F490_HAL_Driver/src/at32f490_crm.c
  /* write hick calibration value */
  CRM->ctrl_bit.hickcal = cali_value;

  /* disable write hick calibration */
  CRM->misc1_bit.hickcal_key = 0x0;
}

/** 
  * @brief  enable or disable the peripheral clock
  * @param  value
  *         this parameter can be one of the following values:
  *         - CRM_GPIOA_PERIPH_CLOCK        - CRM_GPIOB_PERIPH_CLOCK        - CRM_GPIOC_PERIPH_CLOCK       - CRM_GPIOD_PERIPH_CLOCK
  *         - CRM_GPIOF_PERIPH_CLOCK        - CRM_CRC_PERIPH_CLOCK          - CRM_DMA1_PERIPH_CLOCK        - CRM_DMA2_PERIPH_CLOCK
  *         - CRM_OTGHS_PERIPH_CLOCK        - CRM_OTGFS1_PERIPH_CLOCK       - CRM_QSPI1_PERIPH_CLOCK       - CRM_TMR2_PERIPH_CLOCK
  *         - CRM_TMR3_PERIPH_CLOCK         - CRM_TMR4_PERIPH_CLOCK         - CRM_TMR6_PERIPH_CLOCK        - CRM_TMR7_PERIPH_CLOCK
  *         - CRM_TMR13_PERIPH_CLOCK        - CRM_TMR14_PERIPH_CLOCK        - CRM_WWDT_PERIPH_CLOCK        - CRM_SPI2_PERIPH_CLOCK
  *         - CRM_SPI3_PERIPH_CLOCK         - CRM_USART2_PERIPH_CLOCK       - CRM_USART3_PERIPH_CLOCK      - CRM_USART4_PERIPH_CLOCK
  *         - CRM_USART5_PERIPH_CLOCK       - CRM_I2C1_PERIPH_CLOCK         - CRM_I2C2_PERIPH_CLOCK        - CRM_I2C3_PERIPH_CLOCK
  *         - CRM_CAN1_PERIPH_CLOCK         - CRM_PWC_PERIPH_CLOCK          - CRM_UART7_PERIPH_CLOCK       - CRM_UART8_PERIPH_CLOCK
  *         - CRM_TMR1_PERIPH_CLOCK         - CRM_USART1_PERIPH_CLOCK       - CRM_USART6_PERIPH_CLOCK      - CRM_ADC1_PERIPH_CLOCK
  *         - CRM_SPI1_PERIPH_CLOCK         - CRM_SCFG_PERIPH_CLOCK         - CRM_TMR9_PERIPH_CLOCK        - CRM_TMR10_PERIPH_CLOCK
  *         - CRM_TMR11_PERIPH_CLOCK        - CRM_I2SF5_PERIPH_CLOCK        - CRM_ACC_PERIPH_CLOCK         - CRM_OTGHSPHY_PERIPH_CLOCK
  * @param  new_state (TRUE or FALSE)
  * @retval none
  */
void crm_periph_clock_enable(crm_periph_clock_type value, confirm_state new_state)
{
  /* enable periph clock */
  if(TRUE == new_state)
  {
    CRM_REG(value) |= CRM_REG_BIT(value);
  }
  /* disable periph clock */
  else
  {
    CRM_REG(value) &= ~(CRM_REG_BIT(value));
  }
}

/** 
  * @brief  enable or disable the peripheral reset 
  * @param  value
  *         this parameter can be one of the following values:
  *         - CRM_GPIOA_PERIPH_RESET        - CRM_GPIOB_PERIPH_RESET        - CRM_GPIOC_PERIPH_RESET       - CRM_GPIOD_PERIPH_RESET
  *         - CRM_GPIOF_PERIPH_RESET        - CRM_CRC_PERIPH_RESET          - CRM_DMA1_PERIPH_RESET        - CRM_DMA2_PERIPH_RESET
  *         - CRM_OTGHS_PERIPH_RESET        - CRM_OTGFS1_PERIPH_RESET       - CRM_QSPI1_PERIPH_RESET       - CRM_TMR2_PERIPH_RESET
  *         - CRM_TMR3_PERIPH_RESET         - CRM_TMR4_PERIPH_RESET         - CRM_TMR6_PERIPH_RESET        - CRM_TMR7_PERIPH_RESET
  *         - CRM_TMR13_PERIPH_RESET        - CRM_TMR14_PERIPH_RESET        - CRM_WWDT_PERIPH_RESET        - CRM_SPI2_PERIPH_RESET
  *         - CRM_SPI3_PERIPH_RESET         - CRM_USART2_PERIPH_RESET       - CRM_USART3_PERIPH_RESET      - CRM_USART4_PERIPH_RESET
  *         - CRM_USART5_PERIPH_RESET       - CRM_I2C1_PERIPH_RESET         - CRM_I2C2_PERIPH_RESET        - CRM_I2C3_PERIPH_RESET
  *         - CRM_CAN1_PERIPH_RESET         - CRM_PWC_PERIPH_RESET          - CRM_UART7_PERIPH_RESET       - CRM_UART8_PERIPH_RESET
  *         - CRM_TMR1_PERIPH_RESET         - CRM_USART1_PERIPH_RESET       - CRM_USART6_PERIPH_RESET      - CRM_ADC_PERIPH_RESET
  *         - CRM_SPI1_PERIPH_RESET         - CRM_SCFG_PERIPH_RESET         - CRM_TMR9_PERIPH_RESET        - CRM_TMR10_PERIPH_RESET
  *         - CRM_TMR11_PERIPH_RESET        - CRM_I2SF5_PERIPH_RESET        - CRM_ACC_PERIPH_RESET         - CRM_OTGHSPHY_PERIPH_RESET
  * @param  new_state (TRUE or FALSE)
  * @retval none
  */
void crm_periph_reset(crm_periph_reset_type value, confirm_state new_state)
{
  /* enable periph reset */
  if(new_state == TRUE)
  {
    CRM_REG(value) |= (CRM_REG_BIT(value));
  }
  /* disable periph reset */
  else
  {
    CRM_REG(value) &= ~(CRM_REG_BIT(value));
  }
}

/** 
  * @brief  enable or disable the peripheral clock in lowpower mode
  * @param  value
  *         this parameter can be one of the following values:
  *         - CRM_GPIOA_PERIPH_LOWPOWER     - CRM_GPIOB_PERIPH_LOWPOWER     - CRM_GPIOC_PERIPH_LOWPOWER    - CRM_GPIOD_PERIPH_LOWPOWER
  *         - CRM_GPIOF_PERIPH_LOWPOWER     - CRM_CRC_PERIPH_LOWPOWER       - CRM_DMA1_PERIPH_LOWPOWER     - CRM_DMA2_PERIPH_LOWPOWER
  *         - CRM_OTGHS_PERIPH_LOWPOWER     - CRM_OTGFS1_PERIPH_LOWPOWER    - CRM_QSPI1_PERIPH_LOWPOWER    - CRM_TMR2_PERIPH_LOWPOWER
  *         - CRM_TMR3_PERIPH_LOWPOWER      - CRM_TMR4_PERIPH_LOWPOWER      - CRM_TMR6_PERIPH_LOWPOWER     - CRM_TMR7_PERIPH_LOWPOWER
  *         - CRM_TMR13_PERIPH_LOWPOWER     - CRM_TMR14_PERIPH_LOWPOWER     - CRM_WWDT_PERIPH_LOWPOWER     - CRM_SPI2_PERIPH_LOWPOWER
  *         - CRM_SPI3_PERIPH_LOWPOWER      - CRM_USART2_PERIPH_LOWPOWER    - CRM_USART3_PERIPH_LOWPOWER   - CRM_USART4_PERIPH_LOWPOWER
  *         - CRM_USART5_PERIPH_LOWPOWER    - CRM_I2C1_PERIPH_LOWPOWER      - CRM_I2C2_PERIPH_LOWPOWER     - CRM_I2C3_PERIPH_LOWPOWER
  *         - CRM_CAN1_PERIPH_LOWPOWER      - CRM_PWC_PERIPH_LOWPOWER       - CRM_UART7_PERIPH_LOWPOWER    - CRM_UART8_PERIPH_LOWPOWER
  *         - CRM_TMR1_PERIPH_LOWPOWER      - CRM_USART1_PERIPH_LOWPOWER    - CRM_USART6_PERIPH_LOWPOWER   - CRM_ADC1_PERIPH_LOWPOWER
  *         - CRM_SPI1_PERIPH_LOWPOWER      - CRM_SCFG_PERIPH_LOWPOWER      - CRM_TMR9_PERIPH_LOWPOWER     - CRM_TMR10_PERIPH_LOWPOWER
  *         - CRM_TMR11_PERIPH_LOWPOWER     - CRM_I2SF5_PERIPH_LOWPOWER     - CRM_ACC_PERIPH_LOWPOWER      - CRM_OTGHSPHY1_PERIPH_LOWPOWER
  *         - CRM_OTGHSPHY1_PERIPH_LOWPOWER
  * @param  new_state (TRUE or FALSE)
  * @retval none
  */
void crm_periph_lowpower_mode_enable(crm_periph_clock_lowpower_type value, confirm_state new_state)
{
  /* enable periph clock in lowpower mode */
  if(new_state == TRUE)
  {
    CRM_REG(value) |= (CRM_REG_BIT(value));
  }
  /* disable periph clock in lowpower mode */
  else
  {
    CRM_REG(value) &= ~(CRM_REG_BIT(value));
  }
}

/** 
  * @brief  enable or disable the crm clock source
  * @param  source
  *         this parameter can be one of the following values:
  *         - CRM_CLOCK_SOURCE_HICK
  *         - CRM_CLOCK_SOURCE_HEXT
  *         - CRM_CLOCK_SOURCE_PLL
  *         - CRM_CLOCK_SOURCE_LEXT
  *         - CRM_CLOCK_SOURCE_LICK
  * @param  new_state (TRUE or FALSE)
  * @retval none
  */
void crm_clock_source_enable(crm_clock_source_type source, confirm_state new_state)
{
  switch(source)
  {
    case CRM_CLOCK_SOURCE_HICK:
      CRM->ctrl_bit.hicken = new_state;
      break;
    case CRM_CLOCK_SOURCE_HEXT:
      CRM->ctrl_bit.hexten = new_state;
      break;
    case CRM_CLOCK_SOURCE_PLL:
      CRM->ctrl_bit.pllen = new_state;
      break;
    case CRM_CLOCK_SOURCE_LEXT:
      CRM->bpdc_bit.lexten = new_state;
      break;
    case CRM_CLOCK_SOURCE_LICK:
      CRM->ctrlsts_bit.licken = new_state;
      break;
    default: break;
  }
}

/** 
  * @brief  clear the crm reset flags
  * @param  flag
  *         this parameter can be one of the following values:
  *         reset flag:
  *         - CRM_NRST_RESET_FLAG
  *         - CRM_POR_RESET_FLAG
  *         - CRM_SW_RESET_FLAG
  *         - CRM_WDT_RESET_FLAG
  *         - CRM_WWDT_RESET_FLAG
  *         - CRM_LOWPOWER_RESET_FLAG
  *         - CRM_ALL_RESET_FLAG
  *         interrupt flag:
  *         - CRM_LICK_READY_INT_FLAG
  *         - CRM_LEXT_READY_INT_FLAG
  *         - CRM_HICK_READY_INT_FLAG
  *         - CRM_HEXT_READY_INT_FLAG
  *         - CRM_PLL_READY_INT_FLAG
  *         - CRM_CLOCK_FAILURE_INT_FLAG
  * @retval none
  */
void crm_flag_clear(uint32_t flag)
{
  switch(flag)
  {
    case CRM_NRST_RESET_FLAG:
    case CRM_POR_RESET_FLAG:
    case CRM_SW_RESET_FLAG:
    case CRM_WDT_RESET_FLAG:
    case CRM_WWDT_RESET_FLAG:
    case CRM_LOWPOWER_RESET_FLAG:
    case CRM_ALL_RESET_FLAG:
      CRM->ctrlsts_bit.rstfc = TRUE;
      while(CRM->ctrlsts_bit.rstfc == TRUE);
      break;
    case CRM_LICK_READY_INT_FLAG:
      CRM->clkint_bit.lickstblfc = TRUE;
      break;
    case CRM_LEXT_READY_INT_FLAG:
      CRM->clkint_bit.lextstblfc = TRUE;
      break;
    case CRM_HICK_READY_INT_FLAG:
      CRM->clkint_bit.hickstblfc = TRUE;
      break;
    case CRM_HEXT_READY_INT_FLAG:
      CRM->clkint_bit.hextstblfc = TRUE;
      break;
    case CRM_PLL_READY_INT_FLAG:
      CRM->clkint_bit.pllstblfc = TRUE;
      break;
    case CRM_CLOCK_FAILURE_INT_FLAG:
      CRM->clkint_bit.cfdfc = TRUE;
      break;
    default:
      break;
  }
}

/** 
  * @brief  select ertc clock
  * @param  value
  *         this parameter can be one of the following values:
  *         - CRM_ERTC_CLOCK_NOCLK
  *         - CRM_ERTC_CLOCK_LEXT
  *         - CRM_ERTC_CLOCK_LICK
  *         - CRM_ERTC_CLOCK_HEXT_DIV_2
  *         - CRM_ERTC_CLOCK_HEXT_DIV_3
  *         - CRM_ERTC_CLOCK_HEXT_DIV_4
  *         - CRM_ERTC_CLOCK_HEXT_DIV_5
  *         - CRM_ERTC_CLOCK_HEXT_DIV_6
  *         - CRM_ERTC_CLOCK_HEXT_DIV_7
  *         - CRM_ERTC_CLOCK_HEXT_DIV_8
  *         - CRM_ERTC_CLOCK_HEXT_DIV_9
  *         - CRM_ERTC_CLOCK_HEXT_DIV_10
  *         - CRM_ERTC_CLOCK_HEXT_DIV_11
  *         - CRM_ERTC_CLOCK_HEXT_DIV_12
  *         - CRM_ERTC_CLOCK_HEXT_DIV_13
  *         - CRM_ERTC_CLOCK_HEXT_DIV_14
  *         - CRM_ERTC_CLOCK_HEXT_DIV_15
  *         - CRM_ERTC_CLOCK_HEXT_DIV_16
  *         - CRM_ERTC_CLOCK_HEXT_DIV_17
  *         - CRM_ERTC_CLOCK_HEXT_DIV_18
  *         - CRM_ERTC_CLOCK_HEXT_DIV_19
  *         - CRM_ERTC_CLOCK_HEXT_DIV_20
  *         - CRM_ERTC_CLOCK_HEXT_DIV_21
  *         - CRM_ERTC_CLOCK_HEXT_DIV_22
  *         - CRM_ERTC_CLOCK_HEXT_DIV_23
  *         - CRM_ERTC_CLOCK_HEXT_DIV_24
  *         - CRM_ERTC_CLOCK_HEXT_DIV_25
  *         - CRM_ERTC_CLOCK_HEXT_DIV_26
  *         - CRM_ERTC_CLOCK_HEXT_DIV_27
  *         - CRM_ERTC_CLOCK_HEXT_DIV_28
  *         - CRM_ERTC_CLOCK_HEXT_DIV_29
  *         - CRM_ERTC_CLOCK_HEXT_DIV_30
  *         - CRM_ERTC_CLOCK_HEXT_DIV_31
  * @retval none
  */
void crm_ertc_clock_select(crm_ertc_clock_type value)
{
  CRM->cfg_bit.ertcdiv = ((value & 0x1F0) >> 4);
  CRM->bpdc_bit.ertcsel = (value & 0xF);
}

/** 
  * @brief  enable or disable ertc
  * @param  new_state (TRUE or FALSE)
  * @retval none
  */
void crm_ertc_clock_enable(confirm_state new_state)
{
  CRM->bpdc_bit.ertcen = new_state;
}

/** 
  * @brief  set crm ahb division
  * @param  value
  *         this parameter can be one of the following values:
  *         - CRM_AHB_DIV_1
  *         - CRM_AHB_DIV_2
  *         - CRM_AHB_DIV_4
  *         - CRM_AHB_DIV_8
  *         - CRM_AHB_DIV_16
  *         - CRM_AHB_DIV_64
  *         - CRM_AHB_DIV_128
  *         - CRM_AHB_DIV_256
  *         - CRM_AHB_DIV_512
  * @retval none
  */
void crm_ahb_div_set(crm_ahb_div_type value)
{
  /* enable auto step mode */
  crm_auto_step_mode_enable(TRUE);

  CRM->cfg_bit.ahbdiv = value;

  /* disable auto step mode */
  crm_auto_step_mode_enable(FALSE);
}

/** 
  * @brief  set crm apb1 division
  * @note   the maximum frequency of APB1 clock is 120 MHz
  * @param  value
  *         this parameter can be one of the following values:
  *         - CRM_APB1_DIV_1
  *         - CRM_APB1_DIV_2
  *         - CRM_APB1_DIV_4
  *         - CRM_APB1_DIV_8
  *         - CRM_APB1_DIV_16
  * @retval none
  */
void crm_apb1_div_set(crm_apb1_div_type value)
{
  CRM->cfg_bit.apb1div = value;
}

/** 
  * @brief  set crm apb2 division
  * @note   the maximum frequency of APB2 clock is 216 MHz
  * @param  value
  *         this parameter can be one of the following values:
  *         - CRM_APB2_DIV_1
  *         - CRM_APB2_DIV_2
  *         - CRM_APB2_DIV_4
  *         - CRM_APB2_DIV_8
  *         - CRM_APB2_DIV_16
  * @retval none
  */
void crm_apb2_div_set(crm_apb2_div_type value)
{
  CRM->cfg_bit.apb2div = value;
}

/**
  * @brief  set crm hext to sysclk division
  * @param  value
  *         this parameter can be one of the following values:
  *         - CRM_HEXT_SCLK_DIV_1
  *         - CRM_HEXT_SCLK_DIV_2
  *         - CRM_HEXT_SCLK_DIV_4
  *         - CRM_HEXT_SCLK_DIV_8
  *         - CRM_HEXT_SCLK_DIV_16
  *         - CRM_HEXT_SCLK_DIV_32
  * @retval none
  */
void crm_hext_sclk_div_set(crm_hext_sclk_div_type value)
{
  CRM->misc2_bit.hext_to_sclk_div = value;
}

/**
  * @brief  set crm hick to sysclk division
  * @param  value
  *         this parameter can be one of the following values:
  *         - CRM_HICK_SCLK_DIV_1
  *         - CRM_HICK_SCLK_DIV_2
  *         - CRM_HICK_SCLK_DIV_4
  *         - CRM_HICK_SCLK_DIV_8
  *         - CRM_HICK_SCLK_DIV_16
  * @retval none
  */
void crm_hick_sclk_div_set(crm_hick_sclk_div_type value)
{
  CRM->misc2_bit.hick_to_sclk_div = value;
}

/** 
  * @brief  enable or disable clock failure detection
  * @param  new_state (TRUE or FALSE)
  * @retval none
  */
void crm_clock_failure_detection_enable(confirm_state new_state)
{
  CRM->ctrl_bit.cfden = new_state;
}

/** 
  * @brief  battery powered domain software reset
  * @param  new_state (TRUE or FALSE)
  * @retval none
  */
void crm_battery_powered_domain_reset(confirm_state new_state)
{
  CRM->bpdc_bit.bpdrst = new_state;
}

/** 
  * @brief  auto step clock switch enable
  * @param  new_state (TRUE or FALSE)
  * @retval none
  */
void crm_auto_step_mode_enable(confirm_state new_state)
{
  if(new_state == TRUE)
    CRM->misc2_bit.auto_step_en = CRM_AUTO_STEP_MODE_ENABLE;
  else
    CRM->misc2_bit.auto_step_en = CRM_AUTO_STEP_MODE_DISABLE;
}

/** 
  * @brief  i2sf5 clock source select
  * @param  value
  *         this parameter can be one of the following values:
  *         - CRM_I2SF5_CLOCK_SOURCE_PLLP
  *         - CRM_I2SF5_CLOCK_SOURCE_HICK
  *         - CRM_I2SF5_CLOCK_SOURCE_SCLK
  *         - CRM_I2SF5_CLOCK_SOURCE_EXTERNAL
  * @retval none
  */
void crm_i2sf5_clock_select(crm_i2sf5_clock_source_type value)
{
  CRM->cfg_bit.i2sf5clksel = value;
}

/** 
  * @brief  config hick divider select
  * @param  value
  *         this parameter can be one of the following values:
  *         - CRM_HICK48_DIV6
  *         - CRM_HICK48_NODIV
  * @retval none
  */
void crm_hick_divider_select(crm_hick_div_6_type value)
{
  __IO uint8_t temp_div = CRM->misc2_bit.hick_to_sclk_div;
  __IO uint8_t temp_sclk = CRM->misc1_bit.hick_to_sclk;

  crm_hick_sclk_div_set(CRM_HICK_SCLK_DIV_16);
  /* delay */
  {
    __NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();
    __NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();
    __NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();
    __NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();
  }

  CRM->misc1_bit.hick_to_sclk = TRUE;
  CRM->misc1_bit.hickdiv = value;
  CRM->misc1_bit.hick_to_sclk = temp_sclk;
  crm_hick_sclk_div_set((crm_hick_sclk_div_type)temp_div);
}

/** 
  * @brief  hick as system clock frequency select
  * @param  value
  *         this parameter can be one of the following values:
  *         - CRM_HICK_SCLK_8MHZ
  *         - CRM_HICK_SCLK_48MHZ
  * @retval none
  */
void crm_hick_sclk_frequency_select(crm_hick_sclk_frequency_type value)
{
  __IO uint8_t temp_div = CRM->misc2_bit.hick_to_sclk_div;

  crm_hick_sclk_div_set(CRM_HICK_SCLK_DIV_16);
  /* delay */
  {
    __NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();
    __NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();
    __NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();
    __NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();
  }

  CRM->misc1_bit.hick_to_sclk = TRUE;
  CRM->misc1_bit.hickdiv = CRM_HICK48_NODIV;
  CRM->misc1_bit.hick_to_sclk = value;
  crm_hick_sclk_div_set((crm_hick_sclk_div_type)temp_div);
}

/** 
  * @brief  usb 48 mhz clock source select
  * @param  value
  *         this parameter can be one of the following values:
  *         - CRM_USB_CLOCK_SOURCE_PLLU
  *         - CRM_USB_CLOCK_SOURCE_HICK
  * @retval none
  */
void crm_usb_clock_source_select(crm_usb_clock_source_type value)
{
  if(value == CRM_USB_CLOCK_SOURCE_HICK)
  {
    crm_hick_sclk_frequency_select(CRM_HICK_SCLK_48MHZ);
  } 
  CRM->misc2_bit.pllu_usb48_sel = value;
}

/** 
  * @brief  usb phy  12mhz clock source select
  * @param  value
  *         this parameter can be one of the following values:
  *         - CRM_USB_PHY12_CLOCK_HEXT_DIV_1
  * @retval none
  */
void crm_usb_phy12_clock_select(crm_usb_phy12_clock_type value)
{
  CRM->otghs_bit.usbhs_phy12_sel = value;
}

/** 
  * @brief  config crm pll
  *                        pll_rcs_freq * pll_ns
  *         pll clock = --------------------------------
  *                           pll_ms * pll_fr_n
  *         attemtion:
  *                  31 <= pll_ns <= 500
  *                  1  <= pll_ms <= 15
  *
  *                       pll_rcs_freq
  *         2mhz <=  ---------------------- <= 16mhz
  *                          pll_ms
  *
  *                       pll_rcs_freq * pll_ns
  *         500mhz <=  -------------------------------- <= 1000mhz
  *                               pll_ms
  * @param  clock_source
  *         this parameter can be one of the following values:
  *         - CRM_PLL_SOURCE_HICK
  *         - CRM_PLL_SOURCE_HEXT
  * @param  pll_ns (31~500)
  * @param  pll_ms (1~15)
  * @param  pll_fp
  *         this parameter can be one of the following values:
  *         - CRM_PLL_FP_1 
  *         - CRM_PLL_FP_2 
  *         - CRM_PLL_FP_4 
  *         - CRM_PLL_FP_6 
  *         - CRM_PLL_FP_8 
  *         - CRM_PLL_FP_10
  *         - CRM_PLL_FP_12
  *         - CRM_PLL_FP_14
  *         - CRM_PLL_FP_16
  *         - CRM_PLL_FP_18
  *         - CRM_PLL_FP_20
  *         - CRM_PLL_FP_22
  *         - CRM_PLL_FP_24
  *         - CRM_PLL_FP_26
  *         - CRM_PLL_FP_28
  *         - CRM_PLL_FP_30
  * @retval none
  */
void crm_pll_config(crm_pll_clock_source_type clock_source, uint16_t pll_ns, \
                    uint16_t pll_ms, crm_pll_fp_type pll_fp)
{
  /* config pll clock source */
  if(clock_source == CRM_PLL_SOURCE_HICK)
  {
    crm_hick_divider_select(CRM_HICK48_NODIV);
  }
  CRM->pllcfg_bit.pllrcs = clock_source;

  /* config pll multiplication factor */
  CRM->pllcfg_bit.pllns = pll_ns;
  CRM->pllcfg_bit.pllms = pll_ms;
  CRM->pllcfg_bit.pllfp = pll_fp;
}

/** 
  * @brief  set pllu division when pllu selected as usb clock.
  * @param  pll_fu
  *         this parameter can be one of the following values:
  *         - CRM_PLL_FU_11
  *         - CRM_PLL_FU_12
  *         - CRM_PLL_FU_13
  *         - CRM_PLL_FU_14
  *         - CRM_PLL_FU_16
  *         - CRM_PLL_FU_18
  *         - CRM_PLL_FU_20
  * @retval none
  */
void crm_pllu_div_set(crm_pll_fu_type pll_fu)
{
  CRM->pllcfg_bit.pllfu = pll_fu;
}

/** 
  * @brief  config crm pllu output
  * @param  confirm_state
  *         TRUE or FALSE
  * @retval none
  */
void crm_pllu_output_set(confirm_state new_state)
{
  /* config pll clock source type output */
  CRM->pllcfg_bit.plluen = new_state;
}

/** 
  * @brief  select system clock source
  * @param  value
  *         this parameter can be one of the following values:
  *         - CRM_SCLK_HICK
  *         - CRM_SCLK_HEXT
  *         - CRM_SCLK_PLL
  * @retval none
  */
void crm_sysclk_switch(crm_sclk_type value)
{
  /* enable auto step mode */
  crm_auto_step_mode_enable(TRUE);

  CRM->cfg_bit.sclksel = value;

  /* disable auto step mode */
  crm_auto_step_mode_enable(FALSE);
}

/** 
  * @brief  indicate which clock source is used as system clock
  * @param  none
  * @retval crm_sclk
  *         this return can be one of the following values:
  *         - CRM_SCLK_HICK
  *         - CRM_SCLK_HEXT
  *         - CRM_SCLK_PLL
  */
crm_sclk_type crm_sysclk_switch_status_get(void)
{
  return (crm_sclk_type)CRM->cfg_bit.sclksts;
}

/** 
  * @brief  get crm clocks freqency
  * @param  clocks_struct
  *         - pointer to the crm_clocks_freq_type structure
  * @retval none
  */
void crm_clocks_freq_get(crm_clocks_freq_type *clocks_struct)
{
  uint32_t pll_ns = 0, pll_ms = 0, pll_fr = 0, pll_clock_source = 0, pllrcsfreq = 0;
  uint32_t temp = 0, div_value = 0, psc = 0;
  crm_sclk_type sclk_source;

